README.org
* Setup package manager
#+BEGIN_SRC emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+END_SRC
* General settings
** Remove welcome message
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
#+END_SRC
** Remove useless UI things
#+BEGIN_SRC emacs-lisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
#+END_SRC
** Define default directory
#+BEGIN_SRC emacs-lisp
(setq default-directory "~/")
#+END_SRC
** Configure font family
#+BEGIN_SRC emacs-lisp
;; Default font
(set-face-attribute 'default nil :font "Iosevka Term Light" :height 150)

;; Pitched fonts
(set-face-attribute 'fixed-pitch nil :font "Iosevka Term Light" :height 150)

;; Variable pitched fonts
(set-face-attribute 'variable-pitch nil :font "Iosevka Term Light" :height 150)
#+END_SRC
** Highlight matching parens
#+BEGIN_SRC emacs-lisp
(show-paren-mode 1)
#+END_SRC
** Autocomplete matching parens
#+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
(add-hook 'org-mode-hook (lambda () (electric-pair-mode -1)))
#+END_SRC
** Line numbers
#+BEGIN_SRC emacs-lisp
(linum-mode 1)
#+END_SRC
* Startup performance
Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.
#+BEGIN_SRC emacs-lisp
;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+END_SRC
* Keep .emacs.d clean
I don’t want a bunch of transient files showing up as untracked in the Git repo so I move them all to another location.
#+BEGIN_SRC emacs-lisp
  ;; Keep transient cruft out of ~/.emacs.d/
  (setq user-emacs-directory "~/.cache/emacs/"
	backup-directory-alist `(("." . ,(expand-file-name "backups" user-emacs-directory)))
	url-history-file (expand-file-name "url/history" user-emacs-directory)
	auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-emacs-directory)
	projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-emacs-directory))

  ;; Keep customization settings in a temporary file
  (setq custom-file
	(if (boundp 'server-socket-dir)
	    (expand-file-name "custom.el" server-socket-dir)
	  (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  (load custom-file t)
#+END_SRC
* Keyboard shortcuts
** Kill current buffer
#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "C-x k") 'kill-current-buffer)
#+END_SRC
* Third party packages
** Which key
which-key is a minor mode for Emacs that displays the key bindings
following your currently entered incomplete command (a prefix) in a
popup. For example, after enabling the minor mode if you enter C-x and
wait for the default of 1 second the minibuffer will expand with all
of the available key bindings that follow C-x (or as many as space
allows given your settings). This includes prefixes like C-x 8 which
are shown in a different face. Screenshots of what the popup will look
like are included below. which-key started as a rewrite of
guide-key-mode, but the feature sets have diverged to a certain
extent.
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))
#+END_SRC
** Modeline
Doom modeline is a cool e minimal modeline for emacs.
#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-height 10)
    )
#+end_src
** Theme
#+BEGIN_SRC emacs-lisp
  (use-package modus-vivendi-theme
    :config
    (load-theme 'modus-vivendi t))
  (use-package modus-operandi-theme)
#+END_SRC
** Bufler
Bufler is an excellent package by alphapapa which enables you to automatically
group all of your Emacs buffers into workspaces by defining a series of grouping
rules. Once you have your groups defined (or use the default configuration which
is quite good already), you can use the bufler-workspace-frame-set command to
focus your current Emacs frame on a particular workspace so that
bufler-switch-buffer will only show buffers from that workspace. In my case,
this allows me to dedicate an EXWM workspace to a specific Bufler workspace so
that only see the buffers I care about in that EXWM workspace.
#+BEGIN_SRC emacs-lisp
  (use-package bufler
    :bind (("C-x C-b" . bufler))
    :config
    (setf bufler-groups
	  (bufler-defgroups
	    ;; Subgroup collecting all named workspaces.
	    (group (auto-workspace))
	    ;; Subgroup collecting buffers in a projectile project.
	    (group (auto-projectile))
	    ;; Grouping browser windows
	    (group
	     ;; Subgroup collecting all `help-mode' and `info-mode' buffers.
	     (group-or "Help/Info"
		       (mode-match "*Help*" (rx bos (or "help-" "helpful-")))
		       ;; (mode-match "*Helpful*" (rx bos "helpful-"))
		       (mode-match "*Info*" (rx bos "info-"))))
	    (group
	     ;; Subgroup collecting all special buffers (i.e. ones that are not
	     ;; file-backed), except `magit-status-mode' buffers (which are allowed to fall
	     ;; through to other groups, so they end up grouped with their project buffers).
	     (group-and "*Special*"
			(name-match "**Special**"
				    (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace" "Pinentry") "*"))
			(lambda (buffer)
			  (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
					       buffer)
				      (funcall (mode-match "Dired" (rx bos "dired"))
					       buffer)
				      (funcall (auto-file) buffer))
			    "*Special*"))))
	    ;; Group remaining buffers by major mode.
	    (auto-mode))))
#+END_SRC
** Diminish
When we diminish a mode, we are saying we want it to continue doing its work for us, but we no longer want to be reminded of it. It becomes a night worker, like a janitor; it becomes an invisible man; it remains a component, perhaps an important one, sometimes an indispensable one, of the mechanism that maintains the day-people’s world, but its place in their thoughts is diminished, usually to nothing. As we grow old we diminish more and more such thoughts, such people, usually to nothing. – Will Mengarini
#+begin_src emacs-lisp
  (use-package diminish)
  (require 'diminish)
  (diminish 'org-roam-mode)
  (diminish 'org-indent-mode)
  (diminish 'company-box-mode)
  (diminish 'buffer-face-mode)
  (diminish 'guru-mode)
  (diminish 'auto-revert-mode)
  (diminish 'flycheck-mode)
  (diminish 'company-mode)
  (diminish 'which-key-mode)
  (diminish 'ivy-mode)
  (diminish 'projectile-mode)
  (diminish 'visual-line-mode)
  (diminish 'undo-tree-mode)
  (diminish 'eldoc-mode)
  (diminish 'yas-minor-mode)
  (diminish 'auto-revert-mode)
#+end_src
** Ivy
I currently use Ivy, Counsel, and Swiper to navigate around files, buffers, and projects super quickly. Here are some workflow notes on how to best use Ivy:

- While in an Ivy minibuffer, you can search within the current results by using S-Space.
- To quickly jump to an item in the minibuffer, use M-s to get Avy line jump keys.
- To see actions for the selected minibuffer item, use M-o and then press the action’s key.
- Super useful: Use C-c C-o to open ivy-occur to open the search results in a separate buffer. From there you can click any item to perform the ivy action.
#+BEGIN_SRC emacs-lisp
(use-package ivy
  :init (ivy-mode 1)
  :config
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  )
#+END_SRC
Swiper is an alternative to isearch that uses ivy to show an overview of all matches.
#+BEGIN_SRC emacs-lisp
(use-package swiper
  :bind (("C-s" . swiper)))
#+END_SRC
ivy-mode ensures that any Emacs command using completing-read-function uses ivy
for completion. Counsel takes this further, providing versions of common Emacs
commands that are customised to make the best use of ivy. For example,
counsel-find-file has some additional keybindings. Pressing DEL will move you to
the parent directory.
#+BEGIN_SRC emacs-lisp
(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x C-f" . counsel-find-file)
         ("C-h f" . counsel-describe-function)
         ("C-h v" . counsel-describe-variable)
         ("C-x b" . counsel-switch-buffer)
         ("C-c k" . counsel-ag))
  :config
  (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history))
#+END_SRC

Ivy-rich adds a more friendly interface for ivy
#+BEGIN_SRC emacs-lisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+END_SRC
** Org roam
It’s a database of notes that make you easily implement a second brain with org mode.

#+BEGIN_SRC emacs-lisp
(use-package org-roam
  :ensure t
  :hook
  (after-init . org-roam-mode)
  :custom
  (org-roam-directory "~/Dropbox/roam/")
  :config
  :bind (:map org-roam-mode-map
              (("C-c n l" . org-roam)
               ("C-c n f" . org-roam-find-file)
               ("C-c n g" . org-roam-graph))
              :map org-mode-map
              (("C-c n i" . org-roam-insert))
              (("C-c n I" . org-roam-insert-immediate))))
#+END_SRC
** Org tempo
This package help defining some snippets like for expanding source blocks
#+BEGIN_SRC emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
#+END_SRC
