README.org
** Multiple cursors
Multiple cursors for Emacs. This is some pretty crazy functionality, so yes, there are kinks. Don't be afraid though, I've been using it since 2011 with great success and much merriment.
#+begin_src emacs-lisp
  (use-package multiple-cursors
    :config
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
    (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))
#+end_src
** Undo tree
Emacs has a powerful undo system. Unlike the standard undo/redo system in
most software, it allows you to recover *any* past state of a buffer
(whereas the standard undo/redo system can lose past states as soon as you
redo). However, this power comes at a price: many people find Emacs' undo
system confusing and difficult to use, spawning a number of packages that
replace it with the less powerful but more intuitive undo/redo system.

Both the loss of data with standard undo/redo, and the confusion of Emacs'
undo, stem from trying to treat undo history as a linear sequence of
changes. It's not. The `undo-tree-mode' provided by this package replaces
Emacs' undo system with a system that treats undo history as what it is: a
branching tree of changes. This simple idea allows the more intuitive
behaviour of the standard undo/redo system to be combined with the power of
never losing any history. An added side bonus is that undo history can in
some cases be stored more efficiently, allowing more changes to accumulate
before Emacs starts discarding history.

The only downside to this more advanced yet simpler undo system is that it
was inspired by Vim. But, after all, most successful religions steal the
best ideas from their competitors!
#+begin_src emacs-lisp
  (use-package undo-tree
    :init (global-undo-tree-mode))
#+end_src
** Paredit
easy way to manipulate lisp
#+begin_src emacs-lisp
  (use-package paredit
    :config
    (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
    (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode))
#+end_src
** Edwina
Dwm like splits whithin emacs
#+begin_src emacs-lisp
  (use-package edwina
    :config
    (setq display-buffer-base-action '(display-buffer-below-selected))
    (edwina-mode 1))
#+end_src
* Mode configuration
** Org mode
*** Text wrap on 80 characters
#+BEGIN_SRC emacs-lisp
(auto-fill-mode)
(setq-default fill-column 80)
#+END_SRC
*** General config
#+BEGIN_SRC emacs-lisp
  (defun cherry/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :hook (org-mode . cherry/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-agenda-files '("~/Dropbox/org/todo.org"))

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)
    (setq org-refile-targets
          '(("archive.org" :maxlevel . 1)))

    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-capture-templates
          '(("t" "Todo" entry (file+olp "~/Dropbox/org/todo.org" "Tasks")
             "* TODO %?\nSCHEDULED: %^t\n" :empty-lines 1)
            ("n" "Note" entry (file+olp "~/Dropbox/org/notes.org" "Inbox")
             "* %?" :empty-lines 1)))

    (define-key global-map (kbd "C-c oc") (lambda () (interactive) (org-capture)))
    (define-key global-map (kbd "C-c oa") (lambda () (interactive) (org-agenda-list)))
    (define-key global-map (kbd "C-c oN") (lambda () (interactive) (find-file "~/Dropbox/org/todo.org")))
    )
#+END_SRC
*** UI changes
    Make headings with cool graphs.
    #+BEGIN_SRC emacs-lisp
    (use-package org-bullets
     :hook (org-mode . (lambda () (org-bullets-mode 1))))
    #+END_SRC
    Put the text on the center for a more word like experience.
    #+BEGIN_SRC emacs-lisp
      (defun cherry/org-mode-visual-fill ()
	(setq visual-fill-column-width 100
	      visual-fill-column-center-text t)
	(visual-fill-column-mode 1))

      (use-package visual-fill-column
	:hook (org-mode . cherry/org-mode-visual-fill))
    #+END_SRC
*** Org kanban view
#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
        '(				; start list
          (" " "Agenda" ((agenda "" ((org-agenda-overriding-header "Today's Schedule:")
                                     (org-agenda-span 'day)
                                     (org-agenda-ndays 1)
                                     (org-agenda-start-on-weekday nil)
                                     (org-agenda-start-day "+0d")
                                     ;; Remove refiling tasks (https://www.reddit.com/r/orgmode/comments/69acg5/orgagendaskipentryif_but_for_categories/)
                                     (org-agenda-skip-function '(cond ((equal (file-name-nondirectory (buffer-file-name)) "refile.org")
                                                                       (outline-next-heading) (1- (point)))
                                                                      (t (org-agenda-skip-entry-if 'todo 'done))
                                                                      ))
                                     ;; (org-agenda-skip-entry-if 'todo 'done)
                                     (org-agenda-todo-ignore-deadlines nil)))
                         ;; Project tickle list.
                         (todo "PROJECT" ((org-agenda-overriding-header "Project list:")
                                          (org-tags-match-list-sublevels nil)))
                         ;; Refiling category set file wide in file.
                         (tags "REFILING" ((org-agenda-overriding-header "Tasks to Refile:")
                                           (org-tags-match-list-sublevels nil)))
                         ;; Tasks upcoming (should be similar to above?)
                         (agenda "" ((org-agenda-overriding-header "Upcoming:")
                                     (org-agenda-span 7)
                                     (org-agenda-start-day "+1d")
                                     (org-agenda-start-on-weekday nil)
                                     (org-agenda-skip-function '(cond ((equal (file-name-nondirectory (buffer-file-name)) "refile.org")
                                                                       (outline-next-heading) (1- (point)))
                                                                      (t (org-agenda-skip-entry-if 'todo 'done))
                                                                      ))
                                     ;; I should set this next one to true, so that deadlines are ignored...?
                                     (org-agenda-todo-ignore-deadlines nil)))
                         ;; Tasks that are unscheduled
                         (todo "TODO" ((org-agenda-overriding-header "Unscheduled Tasks:")
                                       (org-tags-match-list-sublevels nil)
                                       ;; (org-agenda-skip-entry-if 'scheduled 'deadline)
                                       (org-agenda-todo-ignore-scheduled 'all)
                                       ))
                         ;; Tasks that are waiting or someday
                         (todo "WAITING|SOMEDAY" ((org-agenda-overriding-header "Waiting/Someday Tasks:")
                                                  (org-tags-match-list-sublevels nil)))
                         )
           )
          )

        ;; If an item has a (near) deadline, and is scheduled, only show the deadline.
        org-agenda-skip-scheduled-if-deadline-is-shown t
        )

  (defun org-agenda-show-kanban (&optional arg)
    (interactive "P")
    (org-agenda arg " "))

  (global-set-key (kbd "C-c a") #'org-agenda-show-kanban)
#+end_src
** Dired
Dired makes an Emacs buffer containing a listing of a directory, and optionally some of its subdirectories as well. You can use the normal Emacs commands to move around in this buffer, and special Dired commands to operate on the listed files. Dired works with both local and remote directories.
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    )

  (use-package dired-single)
  (use-package all-the-icons-dired
    :after (all-the-icons dired)
    :config
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
    )

  (global-set-key (kbd "C-c d") 'dired-jump)
#+end_src
* Custom functions
** Open eshell on other buffer
#+begin_src emacs-lisp
  (defun open-eshell ()
    "Open eshell"
    (interactive)
    (if (projectile-project-p)
        (projectile-run-eshell)
        (eshell)))

  (defun shell-other-window (buffer-name)
    "Open a `shell' in a new window."
    (interactive)
    (let ((buf (open-eshell)))
      (switch-to-buffer (other-buffer buf))
      (switch-to-buffer-other-window buf)
      (rename-buffer buffer-name)
      ))
#+end_src
** Open named eshell
#+begin_src emacs-lisp
  (defun named-eshell ()
    "Open eshell with buffer name"
    (interactive)
    (shell-other-window (read-string "Enter the shell name: ")))

  (global-set-key (kbd "C-c t") #'named-eshell)
#+end_src
