README.org
** Delete window when =exit= inside eshell
#+begin_src emacs-lisp
  (require 'eshell)

  (defun eshell-lifecycle () 
    (when (not (one-window-p))
      (delete-window)))

  (advice-add 'eshell-life-is-too-much :after 'eshell-lifecycle)
#+end_src

